powerfull/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <registerRecords>AccumulationRegister.ПродажаТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.Оплата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПроданныеТовары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

powerfull/src/Documents/РеализацияТоваров/ManagerModule.bsl
Процедура РеализацияТоваров(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(РеализацияТоваров)
	Макет = Документы.РеализацияТоваров.ПолучитьМакет("РеализацияТоваров");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваров.Дата,
	|	РеализацияТоваров.Номер,
	|	РеализацияТоваров.Склад,
	|	РеализацияТоваров.СуммаДокумента,
	|	РеализацияТоваров.ПроданныеТовары.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПроданныеТоварыШапка = Макет.ПолучитьОбласть("ПроданныеТоварыШапка");
	ОбластьПроданныеТовары = Макет.ПолучитьОбласть("ПроданныеТовары");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ЗначенияПараметров = Новый Структура;
		ЗначенияПараметров.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D"));
		ЗначенияПараметров.Вставить("Номер", УдалитьЛидирующиеНули(Выборка.Номер));
		ЗначенияПараметров.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
		ЗначенияПараметров.Вставить("Склад", Выборка.Склад);
		ЗначенияПараметров.Вставить("СуммаПрописью", СуммаПрописью(Выборка.СуммаДокумента));
		
		ОбластьЗаголовок.Параметры.Заполнить(ЗначенияПараметров);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(ЗначенияПараметров);				
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПроданныеТоварыШапка);
		ВыборкаПроданныеТовары = Выборка.ПроданныеТовары.Выбрать();
		Пока ВыборкаПроданныеТовары.Следующий() Цикл
			ОбластьПроданныеТовары.Параметры.Заполнить(ВыборкаПроданныеТовары);
			ТабДок.Вывести(ОбластьПроданныеТовары, ВыборкаПроданныеТовары.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(ЗначенияПараметров);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Функция УдалитьЛидирующиеНули(Знач Номер)
	
	Пока СтрНачинаетсяС(Номер, "0") Цикл
		  Номер = Сред(Номер, 2);
	КонецЦикла;
	  
	Возврат Номер;
	
КонецФункции

Функция СуммаПрописью(СуммаДокумента)
	
	ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
	Возврат ЧислоПрописью(СуммаДокумента,, ПарПредмета);
		
КонецФункции
